app/Http/Controllers/PostController.php

select * from `posts` where `posts`.`deleted_at` is null
select * from `users`
---
    public function index()
    {
        // Enable query logging
      //  DB::enableQueryLog();

        // Retrieve all posts and users (though users are not used in the view)

        // $posts = Cache::remember('posts', now()->addSeconds(40), function () {
        //     Log::info('Retrieving posts from database' , ['time' => now()]);
        //     return Post::all();
        // });

        //$posts = Post::onlyTrashed()->get();
      //  $posts = Post::whereNotNull('deleted_at')->get();
        //$posts = DB::table('posts')->whereNotNull('deleted_at')->get();
       // dd($posts);
       $posts =  Post::all();
        $users = User::all();

select * from `posts` where `posts`.`deleted_at` is not null
---
    public function archive()
    {

        // Retrieve all posts and users (though users are not used in the view)
        $posts = Post::onlyTrashed()->get();

select * from `posts` where `posts`.`id` = '2' limit 1
update `posts` set `deleted_at` = '', `posts`.`updated_at` = '2024-07-10 14:45:25' where `id` = 2
---
    public function restore(string $id)
    {
        // Find the post by ID
        $post = Post::withTrashed()->findOrFail($id);

        // Restore the post
        $post->restore();

insert into `posts` (`title`, `content`, `slug`, `updated_at`, `created_at`) values ('laravel php native', '# **hello world npm install**\r\n\r\n1. hello create \r\n2. hello teams', 'test1328857851', '2024-07-10 18:39:23', '2024-07-10 18:39:23')
---
    public function store(StorePostRequest $request)
    {
        // Validate the request
        $validated = $request->validated();

        // Prepare data for the new post
        $data = $request->only(['title', 'content']);
        $data['slug'] = "test" . rand();

        // Handle file upload
        if ($request->hasFile('thumbnail')) {
            $file = $request->file('thumbnail');
            $filePath = Storage::disk('public')->putFileAs('posts/images', $file, rand(1, 100) . '.' . $file->getClientOriginalExtension());
            $data['image_post'] = $filePath;
        }

        // Create the post
        $post = Post::create($data);

select * from `posts` where `posts`.`id` = '2' and `posts`.`deleted_at` is null limit 1
---
    public function show(string $id)
    {

        // Find the post by ID or fail
        $post = Post::findOrFail($id);

select * from `posts` where `posts`.`id` = '2' and `posts`.`deleted_at` is null limit 1
---
    public function edit(string $id)
    {
        // Find the post by ID or fail
        $post = Post::findOrFail($id);

select * from `posts` where `posts`.`id` = '2' and `posts`.`deleted_at` is null limit 1
delete from `posts` where `id` = 1
update `posts` set `deleted_at` = '2024-07-09 19:40:15', `posts`.`updated_at` = '2024-07-09 19:40:15' where `id` = 2
select * from `posts` where `posts`.`id` = '1' limit 1
---
    public function update(Request $request, string $id)
    {

        dd($request->all());
        // Find the post by ID
        $post = Post::findOrFail($id);

        // Handle file upload and update image if exists
        if ($request->hasFile('thumbnail')) {
            $file = $request->file('thumbnail');

            if ($post->image_post) {
                Storage::disk('public')->delete($post->image_post);
            }

            $filePath = Storage::disk('public')->putFileAs('posts/images', $file, rand(1, 100) . '.' . $file->getClientOriginalExtension());
            $post->image_post = $filePath;
        }

        // Update the post details
        $post->title = $request->title;
        $post->content = $request->content;
        $post->save();

        return redirect()->route('posts.show', ['post' => $post])->with('status', 'Post was updated!');

select * from `posts` where `posts`.`id` = '5' and `posts`.`deleted_at` is null limit 1
update `posts` set `deleted_at` = '2024-07-10 14:45:40', `posts`.`updated_at` = '2024-07-10 14:45:40' where `id` = 5
---
    public function destroy(string $id)
    {
        // Find and delete the post
        $post = Post::findOrFail($id);
       $post->delete();