app/Http/Controllers/PostController.php

    public function show(string $id)
    {
        // Find the post by ID or fail
        $post = Post::findOrFail($id);
---
select * from `posts` where `posts`.`id` = '8' and `posts`.`deleted_at` is null limit 1